### 1. 데이터 불러오기

In [1]:
import pandas as pd
selloutData = pd.read_csv("../dataset/kopo_product_volume.csv")
selloutData.head()

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201415  810144
1      A01       ST0002    201415  128999
2      A01       ST0001    201418  671464
3      A01       ST0002    201418  134467
4      A01       ST0001    201413  470040

### 2. 그룹바이 심화

### 2-1. 데이터 정렬

In [2]:
sortedData = selloutData.sort_values(["REGIONID","PRODUCTGROUP","YEARWEEK"])
sortedData.reset_index(inplace=True, drop=True)
sortedData.head()

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME
0      A01       ST0001    201401  513598
1      A01       ST0001    201402  438251
2      A01       ST0001    201403  420290
3      A01       ST0001    201404  458431
4      A01       ST0001    201405  482381

#### 그룹바이 하지 않았을 경우 경계선 내에서 그룹의 특성을 반영하지 못한다.

In [4]:
sortedData["MA"] = sortedData["VOLUME"].rolling(window = 5, center = True, min_periods=1).mean()
sortedData.head()
sortedData.to_csv("./ma_result_1.csv")

### 2-2 그룹바이 함수 정의

##### 데이터프레임을 받아서 MA 컬럼을 생성한 후 <- VOLUME  구간5로 이동평균을 산출함

In [13]:
def sub_function(data):
    data.reset_index(drop=True, inplace=True)
    data["MA2"] = data["VOLUME"].rolling(window = 5, center = True, min_periods=1).mean()
    return data

In [14]:
sortedData.head()

  REGIONID PRODUCTGROUP  YEARWEEK  VOLUME             MA
0      A01       ST0001    201401  513598  457379.666667
1      A01       ST0001    201402  438251  457642.500000
2      A01       ST0001    201403  420290  462590.200000
3      A01       ST0001    201404  458431  473953.000000
4      A01       ST0001    201405  482381  510381.200000

In [15]:
pwd

'C:\\Users\\hk2\\Python_CJ_ST\\Session04-1 - GroupBy 심화추가'

In [16]:
groupData = sortedData.groupby(["REGIONID","PRODUCTGROUP"]).apply(sub_function)
groupData.head(10)

                        REGIONID PRODUCTGROUP  YEARWEEK  VOLUME  \
REGIONID PRODUCTGROUP
A01      ST0001       0      A01       ST0001    201401  513598
                      1      A01       ST0001    201402  438251
                      2      A01       ST0001    201403  420290
                      3      A01       ST0001    201404  458431
                      4      A01       ST0001    201405  482381
                      5      A01       ST0001    201406  570412
                      6      A01       ST0001    201407  620392
                      7      A01       ST0001    201408  571781
                      8      A01       ST0001    201409  569545
                      9      A01       ST0001    201410  511679

                                    MA            MA2
REGIONID PRODUCTGROUP
A01      ST0001       0  457379.666667  457379.666667
                      1  457642.500000  457642.500000
                      2  462590.200000  462590.200000
                      3  473953.000000  473953.000000
                      4  510381.200000  510381.200000
                      5  540679.400000  540679.400000
                      6  562902.200000  562902.200000
                      7  568761.800000  568761.800000
                      8  559636.800000  559636.800000
                      9  532860.200000  532860.200000

In [17]:
finalData = groupData.reset_index(drop=True)

In [19]:
finalData.to_csv("./ma_result_2.csv")

### 2-3. 그룹바이 함수 디버깅

In [20]:
groupDataSet = sortedData.groupby(["REGIONID","PRODUCTGROUP"])
groupDataSet

In [21]:
len(groupDataSet)

2

In [22]:
data = groupDataSet.get_group(list(groupDataSet.groups)[1])
data.head()

    REGIONID PRODUCTGROUP  YEARWEEK  VOLUME        MA
133      A01       ST0002    201401  155729  402331.2
134      A01       ST0002    201402  123875  255514.2
135      A01       ST0002    201403  114744  142405.2
136      A01       ST0002    201404  137162  139114.8
137      A01       ST0002    201405  180516  143635.0